In [26]:

import pandas as pd
import numpy as np

A = pd.Series([5, 8, 7, 6, 8, 4])
B = pd.Series([1.3, 2.1, 1.8, 1.2, 1.4, 2.3])
C = pd.Series(['y', 'y', 'n', 'y', 'n', 'n'])

df = pd.DataFrame(zip(A, B, C))

df

   0    1  2
0  5  1.3  y
1  8  2.1  y
2  7  1.8  n
3  6  1.2  y
4  8  1.4  n
5  4  2.3  n

In [61]:
# Indeksin 3 rivi ja 2 sarake
df.iloc[3,2]

'y'

In [48]:
# Nelj√§s rivi eli indeksin 3 kohdassa
df.iloc[3]

0      6
1    1.2
2      y
Name: 3, dtype: object

In [46]:
# Rivit kohdissa 2-5 ja sarakkeet 1-2
df.iloc[2:6, 1:3]

     1  2
2  1.8  n
3  1.2  y
4  1.4  n
5  2.3  n

In [62]:
# Transpoosi
df.T

     0    1    2    3    4    5
0    5    8    7    6    8    4
1  1.3  2.1  1.8  1.2  1.4  2.3
2    y    y    n    y    n    n